update readme with mermaid diagram
